//
//  KeywordsModel.swift
//  PostKit
//
//  Created by 신서연 on 2023/10/12.
//

import SwiftUI

struct KeywordsModel {
    
    public var coffeeKeys = ["특별한 원두", "싱글 오리진", "블렌딩", "강배전", "중배전", "약배전", "강한 산미", "고소한 맛", "적절한 밸런스", "쓴 맛", "무게감", "견과류향", "초콜렛향", "스모키향", "과일향",
                             "꽃향", "디카페인"]
    public var drinkKeys = ["비주얼", "고카페인", "고소한 맛", "달콤한 맛", "건강한 맛", "상큼한 맛", "신맛", "풍부한 향", "신선한 과일", "초콜렛 포함", "프로틴 포함", "말차 포함", "알코올 포함", "허브", "아이스크림 토핑", "시그니처 음료", "시즌 음료"]
    public var dessertKeys = ["고소한 맛", "달콤한 맛", "건강한 맛", "상큼한 맛", "비주얼", "인스타그래머블", "신선한 과일", "특별한 재료", "아이스크림 토핑", "시그니처 디저트", "시즌 디저트"]

}
