//
//  KeywordsModel.swift
//  PostKit
//
//  Created by 신서연 on 2023/10/12.
//

import Foundation
    public var coffeeKeys: [(name: String, num: Int)] = [("특별한 원두", 0),("싱글 오리진", 1),("블랜딩",2),("강배전",3),("중배전",4),("약배전",5),("강한 산미",6),("고소한 맛",7),("적절한 밸런스",8),("쓴 맛",9),("무게감",10),("견과류 향",11),("초콜렛향",12),("스모키향",13),("과일향",14),("꽃향",15),("디카페인",16)]
    public var drinkKeys: [(name: String, num: Int)] = [("비주얼",0),("고카페인",1),("고소한 맛",2),("달콤한 맛",3),("건강한 맛",4),("상큼한 맛",5),("신맛",6),("풍부한 향",7),("신선한 과일",8),("초콜렛 포함",9),("프로틴 포함",10),("말차 포함",11),("알코올 포함",12),("허브",13),("아이스크림 토핑",14),("시그니처 음료",15),("시즌 음료",16)]
    public var dessertKeys: [(name: String, num: Int)] = [("고소한 맛",0),("달콤한 맛",1),("건강한 맛",2),("상큼한 맛",3),("비주얼",4),("인스타그래머블",5),("신선한 과일",6),("특별한 재료",7),("아이스크림 토핑",8),("시그니처 디저트",9),("시즌 디저트",10)]
    public var weatherKeys: [(name: String, num: Int)] = [("맑음",0),("구름 조금",1),("구름 많음",2),("흐림",3),("비",4),("눈",5),("안개",6),("황사",7),("미세먼지",8),("따뜻함",9),("더움",10),("쌀쌀함",11),("추움",12),("봄",13),("여름",14),("가을",15),("겨울",16)]
    public var dailyCoffeeKeys: [(name: String, num: Int)] = [("에스프레소",0),("아메리카노",1),("라떼",2),("콜드브루",3),("아인슈페너",4),("카푸치노",5),("모카",6),("플랫화이트",7),("드립커피",8),("마끼야토",9),("코르타도",10),("아포카토",11),("과일주스",12),("에이드",13),("스무디",14),("티",15)]
    public var dailyDessertKeys: [(name: String, num: Int)] = [("케이크",0),("페이스트리",1),("구움과자",2),("쿠키류",3),("마카롱",4),("머핀",5),("브라우니",6),("파이",7),("타르트",8),("프레즐",9),("디저트류",10),("도넛류",11)]
